# Рекламная акция
# В сети магазинов "Н-Аудио" проводится рекламная акция. Каждый второй товар – бесплатно.
# Естественно, кассирам дано указание пробивать товары в таком порядке, чтобы магазин потерял как можно меньше денег.
# По списку товаров определите максимальную сумму в чеке.
#
# Вход:дано N натуральных чисел – цены товаров.
# Выход: одно число – максимальная сумма чека.

# Пример
# Вход:
# 2 1 10 50 10
# Выход:
# 70
# Пояснение:
# Возможен такой порядок: 10 2 50 1 10

how_many_pourchases = int(input())  # Количество покупок    
prices = [random.randint(1, 50) for _ in range(how_many_pourchases)]

prices.sort(reverse = True)
print(prices)
max_amount = sum(prices[:(how_many_pourchases + 1) // 2])

print(max_amount)
